stress-test/member-scenario.yml
config:
  target: 'http://localhost:3000'     # 테스트할 NestJS API 서버의 URL
  phases:
    - duration: 60                    # 테스트 지속 시간 (초)
      arrivalRate: 1000               # 초당 1000개의 새로운 요청을 보냄
scenarios:
  - name: '회원 생성 후 회원 상세 조회'
    flow:
      # 1. 회원 생성 요청
      - post:
          url: '/members'
          json:
            memberNm: 'John Doe'            # 필수 필드
            nickName: 'Johnny'              # 선택 필드
            tel: '010-1234-5678'            # 필수 필드 (13자리)
            email: 'john.doe@example.com'   # 선택 필드
            regDate: '{{ now }}'            # 현재 시간을 등록일로 설정
          capture:
            - json: '$.memberCd'            # 회원 생성 후 반환된 memberCd를 캡처
              as: 'memberCd'                # 캡처된 값을 memberCd로 저장

      # 2. 캡처된 memberCd로 회원 상세 조회
      - get:
          url: '/members/{{ memberCd }}'    # 캡처된 memberCd를 URL에 사용

##############################################################################################
# $ artillery run member-scenario.yml 실행 결과 (local)
##############################################################################################
#
#Test run id: 비공개
#Phase started: unnamed (index: 0, duration: 60s) 22:15:56(+0900)
#
#  --------------------------------------
#Metrics for period to: 22:16:00(+0900) (width: 3.874s)
#  --------------------------------------
#
#errors.ECONNREFUSED: ........................................................... 2486
#errors.Failed capture or match: ................................................ 135
#http.codes.201: ................................................................ 135
#http.downloaded_bytes: ......................................................... 7687
#http.request_rate: ............................................................. 982/sec
#http.requests: ................................................................. 3614
#http.response_time:
#  min: ......................................................................... 122
#  max: ......................................................................... 3560
#  mean: ........................................................................ 1707.5
#  median: ...................................................................... 1652.8
#  p95: ......................................................................... 3134.5
#  p99: ......................................................................... 3464.1
#http.response_time.2xx:
#  min: ......................................................................... 122
#  max: ......................................................................... 3560
#  mean: ........................................................................ 1707.5
#  median: ...................................................................... 1652.8
#  p95: ......................................................................... 3134.5
#  p99: ......................................................................... 3464.1
#http.responses: ................................................................ 135
#vusers.created: ................................................................ 3616
#vusers.created_by_name.회원 생성 후 회원 상세 조회: ....................................... 3616
#vusers.failed: ................................................................. 2621
#
#
#  --------------------------------------
#Metrics for period to: 22:16:10(+0900) (width: 9.999s)
#  --------------------------------------
#
#errors.ECONNREFUSED: ........................................................... 7598
#errors.ETIMEDOUT: .............................................................. 898
#errors.Failed capture or match: ................................................ 79
#http.codes.201: ................................................................ 79
#http.downloaded_bytes: ......................................................... 4503
#http.request_rate: ............................................................. 828/sec
#http.requests: ................................................................. 8274
#http.response_time:
#  min: ......................................................................... 3666
#  max: ......................................................................... 9871
#  mean: ........................................................................ 6296.2
#  median: ...................................................................... 6187.2
#  p95: ......................................................................... 9801.2
#  p99: ......................................................................... 9801.2
#http.response_time.2xx:
#  min: ......................................................................... 3666
#  max: ......................................................................... 9871
#  mean: ........................................................................ 6296.2
#  median: ...................................................................... 6187.2
#  p95: ......................................................................... 9801.2
#  p99: ......................................................................... 9801.2
#http.responses: ................................................................ 79
#vusers.created: ................................................................ 8274
#vusers.created_by_name.회원 생성 후 회원 상세 조회: ....................................... 8274
#vusers.failed: ................................................................. 8575
#
#
#  --------------------------------------
#Metrics for period to: 22:16:20(+0900) (width: 9.999s)
#  --------------------------------------
#
#errors.ECONNREFUSED: ........................................................... 7184
#errors.ETIMEDOUT: .............................................................. 672
#http.request_rate: ............................................................. 837/sec
#http.requests: ................................................................. 8349
#vusers.created: ................................................................ 8348
#vusers.created_by_name.회원 생성 후 회원 상세 조회: ....................................... 8348
#vusers.failed: ................................................................. 7856
#
#
#  --------------------------------------
#Metrics for period to: 22:16:30(+0900) (width: 9.999s)
#  --------------------------------------
#
#errors.ECONNREFUSED: ........................................................... 8383
#errors.ETIMEDOUT: .............................................................. 1154
#http.request_rate: ............................................................. 1168/sec
#http.requests: ................................................................. 11647
#vusers.created: ................................................................ 11647
#vusers.created_by_name.회원 생성 후 회원 상세 조회: ....................................... 11647
#vusers.failed: ................................................................. 9537
#
#
#  --------------------------------------
#Metrics for period to: 22:16:40(+0900) (width: 9.999s)
#  --------------------------------------
#
#errors.ECONNREFUSED: ........................................................... 5984
#errors.ETIMEDOUT: .............................................................. 3079
#http.request_rate: ............................................................. 925/sec
#http.requests: ................................................................. 9186
#vusers.created: ................................................................ 9187
#vusers.created_by_name.회원 생성 후 회원 상세 조회: ....................................... 9187
#vusers.failed: ................................................................. 9063
#
#
#  --------------------------------------
#Metrics for period to: 22:16:50(+0900) (width: 9.999s)
#  --------------------------------------
#
#errors.ECONNREFUSED: ........................................................... 2391
#errors.ETIMEDOUT: .............................................................. 2742
#http.request_rate: ............................................................. 701/sec
#http.requests: ................................................................. 6299
#vusers.created: ................................................................ 6297
#vusers.created_by_name.회원 생성 후 회원 상세 조회: ....................................... 6297
#vusers.failed: ................................................................. 5133
#
#
#Phase completed: unnamed (index: 0, duration: 60s) 22:17:03(+0900)
#
#  --------------------------------------
#Metrics for period to: 22:17:00(+0900) (width: 9.999s)
#  --------------------------------------
#
#errors.ECONNREFUSED: ........................................................... 1782
#errors.ETIMEDOUT: .............................................................. 3558
#http.request_rate: ............................................................. 611/sec
#http.requests: ................................................................. 5365
#vusers.created: ................................................................ 5368
#vusers.created_by_name.회원 생성 후 회원 상세 조회: ....................................... 5368
#vusers.failed: ................................................................. 5340
#
#
#  --------------------------------------
#Metrics for period to: 22:17:10(+0900) (width: 9.999s)
#  --------------------------------------
#
#errors.EADDRINUSE: ............................................................. 1
#errors.ECONNREFUSED: ........................................................... 781
#errors.ETIMEDOUT: .............................................................. 852
#http.request_rate: ............................................................. 1237/sec
#http.requests: ................................................................. 5559
#vusers.created: ................................................................ 5557
#vusers.created_by_name.회원 생성 후 회원 상세 조회: ....................................... 5557
#vusers.failed: ................................................................. 1634
#
#
#  --------------------------------------
#Metrics for period to: 22:17:20(+0900) (width: 9.982s)
#  --------------------------------------
#
#errors.EADDRINUSE: ............................................................. 3
#errors.ECONNREFUSED: ........................................................... 189
#errors.ETIMEDOUT: .............................................................. 7094
#http.request_rate: ............................................................. 387/sec
#http.requests: ................................................................. 646
#vusers.created: ................................................................ 646
#vusers.created_by_name.회원 생성 후 회원 상세 조회: ....................................... 646
#vusers.failed: ................................................................. 7286
#
#
#  --------------------------------------
#Metrics for period to: 22:17:30(+0900) (width: 9.997s)
#  --------------------------------------
#
#errors.EADDRINUSE: ............................................................. 816
#errors.ETIMEDOUT: .............................................................. 1504
#http.request_rate: ............................................................. 68/sec
#http.requests: ................................................................. 556
#vusers.created: ................................................................ 556
#vusers.created_by_name.회원 생성 후 회원 상세 조회: ....................................... 556
#vusers.failed: ................................................................. 2320
#
#
#  --------------------------------------
#Metrics for period to: 22:17:40(+0900) (width: 7.651s)
#  --------------------------------------
#
#errors.EADDRINUSE: ............................................................. 383
#errors.ETIMEDOUT: .............................................................. 7
#http.request_rate: ............................................................. 80/sec
#http.requests: ................................................................. 379
#vusers.created: ................................................................ 379
#vusers.created_by_name.회원 생성 후 회원 상세 조회: ....................................... 379
#vusers.failed: ................................................................. 390
#
#
#All VUs finished. Total time: 1 minute, 42 seconds
#
#  --------------------------------
#  Summary report @ 22:17:38(+0900)
#  --------------------------------
#
#errors.EADDRINUSE: ............................................................. 1203
#errors.ECONNREFUSED: ........................................................... 36778
#errors.ETIMEDOUT: .............................................................. 21560
#errors.Failed capture or match: ................................................ 214
#http.codes.201: ................................................................ 214
#http.downloaded_bytes: ......................................................... 12190
#http.request_rate: ............................................................. 262/sec
#http.requests: ................................................................. 59874
#http.response_time:
#  min: ......................................................................... 122
#  max: ......................................................................... 9871
#  mean: ........................................................................ 3401.5
#  median: ...................................................................... 2566.3
#  p95: ......................................................................... 8024.5
#  p99: ......................................................................... 9801.2
#http.response_time.2xx:
#  min: ......................................................................... 122
#  max: ......................................................................... 9871
#  mean: ........................................................................ 3401.5
#  median: ...................................................................... 2566.3
#  p95: ......................................................................... 8024.5
#  p99: ......................................................................... 9801.2
#http.responses: ................................................................ 214
#vusers.created: ................................................................ 59875
#vusers.created_by_name.회원 생성 후 회원 상세 조회: ....................................... 59875
#vusers.failed: ................................................................. 59755
#
##############################################################################################